CSI API ETABS v1
cDesignConcreteSlab.GetSummaryResultsSpanDefinition Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResultsSpanDefinition(
	ref string[] StoryName,
	ref string[] DesignStripName,
	ref string[] SpanID,
	ref double[] SpanLength,
	ref double[] StartDist,
	ref double[] EndDist,
	ref double[] GlobalX1,
	ref double[] GlobalY1,
	ref double[] GlobalX2,
	ref double[] GlobalY2
)
Function GetSummaryResultsSpanDefinition (
	ByRef StoryName As String(),
	ByRef DesignStripName As String(),
	ByRef SpanID As String(),
	ByRef SpanLength As Double(),
	ByRef StartDist As Double(),
	ByRef EndDist As Double(),
	ByRef GlobalX1 As Double(),
	ByRef GlobalY1 As Double(),
	ByRef GlobalX2 As Double(),
	ByRef GlobalY2 As Double()
) As Integer
Dim instance As cDesignConcreteSlab
Dim StoryName As String()
Dim DesignStripName As String()
Dim SpanID As String()
Dim SpanLength As Double()
Dim StartDist As Double()
Dim EndDist As Double()
Dim GlobalX1 As Double()
Dim GlobalY1 As Double()
Dim GlobalX2 As Double()
Dim GlobalY2 As Double()
Dim returnValue As Integer
returnValue = instance.GetSummaryResultsSpanDefinition(StoryName,
	DesignStripName, SpanID, SpanLength,
	StartDist, EndDist, GlobalX1, GlobalY1,
	GlobalX2, GlobalY2)
int GetSummaryResultsSpanDefinition(
	array<String^>^% StoryName,
	array<String^>^% DesignStripName,
	array<String^>^% SpanID,
	array<double>^% SpanLength,
	array<double>^% StartDist,
	array<double>^% EndDist,
	array<double>^% GlobalX1,
	array<double>^% GlobalY1,
	array<double>^% GlobalX2,
	array<double>^% GlobalY2
)
abstract GetSummaryResultsSpanDefinition :
        StoryName : string[] byref *
        DesignStripName : string[] byref *
        SpanID : string[] byref *
        SpanLength : float[] byref *
        StartDist : float[] byref *
        EndDist : float[] byref *
        GlobalX1 : float[] byref *
        GlobalY1 : float[] byref *
        GlobalX2 : float[] byref *
        GlobalY2 : float[] byref -> int
Parameters
StoryName
Type: System.String[]
DesignStripName
Type: System.String[]
SpanID
Type: System.String[]
SpanLength
Type: System.Double[]
StartDist
Type: System.Double[]
EndDist
Type: System.Double[]
GlobalX1
Type: System.Double[]
GlobalY1
Type: System.Double[]
GlobalX2
Type: System.Double[]
GlobalY2
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cDesignConcreteSlab Interface
ETABSv1 Namespace